Documents/ЭлектронноеПисьмо.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<Document>
		<Properties>
			<Name>ЭлектронноеПисьмо</Name>
			<Posting>Allow</Posting>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>IDПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресОтправителя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>АдресПолучателя</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Входящее</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДатаОтправки</Name>
					<Type>
						<v8:Type>xs:dateTime</v8:Type>
						<v8:DateQualifiers>
							<v8:DateFractions>DateTime</v8:DateFractions>
						</v8:DateQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Заголовок</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>100</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Комментарий</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Лид</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.Лид</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Обработан</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Основание</Name>
					<Type>
						<v8:TypeSet>cfg:BusinessProcessRef</v8:TypeSet>
						<v8:TypeSet>cfg:DocumentRef</v8:TypeSet>
						<v8:TypeSet>cfg:TaskRef</v8:TypeSet>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Автор</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Пользователи</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправитель</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.УчетныеЗаписиЭлектроннойПочты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Отправлен</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстПисьма</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ТекстHTML</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>0</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>Получатели</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>Контрагент</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.Сотрудники</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Email</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>255</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>Отправлено</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ДатаОтправки</Name>
							<Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Document>
</MetaDataObject>

InformationRegisters/ПрикрепленныеДанныеЭлектронныхПисем.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.21">
	<InformationRegister>
		<Properties>
			<Name>ПрикрепленныеДанныеЭлектронныхПисем</Name>
			<InformationRegisterPeriodicity>Second</InformationRegisterPeriodicity>
			<WriteMode>Independent</WriteMode>
		</Properties>
		<ChildObjects>
			<Resource>
				<Properties>
					<Name>Данные</Name>
					<Type>
						<v8:Type>v8:ValueStorage</v8:Type>
					</Type>
				</Properties>
			</Resource>
			<Resource>
				<Properties>
					<Name>Расширение</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>5</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Resource>
			<Dimension>
				<Properties>
					<Name>СсылкаНаОбъект</Name>
					<Type>
						<v8:Type>cfg:DocumentRef.ЭлектронноеПисьмо</v8:Type>
					</Type>
				</Properties>
			</Dimension>
			<Dimension>
				<Properties>
					<Name>ИмяФайла</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>255</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Dimension>
		</ChildObjects>
	</InformationRegister>
</MetaDataObject>

Documents/ЭлектронноеПисьмо/Forms/ФормаДокумента/Ext/Form/Module.bsl
#Область ОбработчикиСобытийФормы

&НаСервере
Процедура ПриСозданииНаСервере(Отказ, СтандартнаяОбработка)
	
	Если Параметры.Ключ.Пустая() Тогда
		
		Если НЕ Объект.Автор.УчетнаяЗаписьЭлектроннойПочты.Пустая() Тогда
			Объект.Отправитель = Объект.Автор.УчетнаяЗаписьЭлектроннойПочты;
			ОтправительПриИзмененииНаСервере();
		Иначе
			Объект.Отправитель = Константы.УчетнаяЗаписьЭлектроннойПочтыПоУмолчанию.Получить();
			ОтправительПриИзмененииНаСервере();
		КонецЕсли;
		
	Иначе
		ЭтаФорма.ТолькоПросмотр = ПраваПользователей.ДокументТолькоПросмотр(Объект.Ссылка);
	КонецЕсли;
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКоманды.ПриСозданииНаСервере(ЭтотОбъект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
		
	//Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
	//	Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	//	КонтрагентДополнительно = Объект.Контрагент.Дополнительно;
	//Иначе
	//	Элементы.КонтрагентДополнительно.Видимость = Ложь;
	//КонецЕсли;
	
	Элементы.ФормаГруппаПодменю.Видимость = Объект.Входящее;
	
	Элементы.ГруппаТекстHTML.Видимость = НЕ ПустаяСтрока(Объект.ТекстHTML);
	Элементы.ГруппаПростойТекст.Видимость = НЕ Элементы.ГруппаТекстHTML.Видимость;
	
	УстановитьУсловноеОформление(); // №8201 добавили УФ
	
	Элементы.ФормаТекстовоеСодержимоеПисьма.Видимость = НЕ ПустаяСтрока(Объект.ТекстHTML);
	
	Элементы.ФормаВложитьФайлИзОснования.Видимость = ЗначениеЗаполнено(Объект.Основание);
	
КонецПроцедуры

&НаСервере
Процедура ПриЧтенииНаСервере(ТекущийОбъект)
	ДатыЗапретаИзменения.ОбъектПриЧтенииНаСервере(ЭтотОбъект, ТекущийОбъект);
	
	// СтандартныеПодсистемы.ПодключаемыеКоманды
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
	// Конец СтандартныеПодсистемы.ПодключаемыеКоманды
КонецПроцедуры

&НаКлиенте
Процедура ПриОткрытии(Отказ)
	
	ОбновитьФорму();
	
	//++ №8201 комментируем
	//Элементы.НесколькоПолучателей.Доступность = Не Объект.Отправлен;
	//Если Не Объект.Отправлен Тогда
	//	НесколькоПолучателей = Объект.Получатели.Количество() > 1;
	//	НесколькоПолучателей(Истина);
	//КонецЕсли;
	//-- №8201
	
КонецПроцедуры

&НаКлиенте
Процедура ПередЗаписью(Отказ, ПараметрыЗаписи)
	Если НЕ ОбщийМодульКлиент.ПроверитьДоступностиРасширенногоФункционала() тогда
		Отказ = Истина;
		Возврат;
	КонецЕсли;
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиСобытийЭлементовФормы

&НаКлиенте
Процедура ОтправительПриИзменении(Элемент)
	ОтправительПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура ОтправительПриИзмененииНаСервере()
	
	Если ПустаяСтрока(Объект.ТекстПисьма) Тогда
		Объект.ТекстПисьма = РаботаСЭлектроннойПочтой.ПолучитьПодписьЭлектронногоПисьма(Объект.Отправитель);
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура КонтрагентПриИзменении(Элемент)
	КонтрагентПриИзмененииНаСервере();
КонецПроцедуры

&НаСервере
Процедура КонтрагентПриИзмененииНаСервере()
	
	АдресПолучателя = ОбщийМодульСервер.ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(Объект.Контрагент);
	Объект.АдресПолучателя = АдресПолучателя;
	
	// №8201 комментируем, т.к. не к чему добавлять 
	//Объект.Получатели.Очистить();
	//Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
	//	НовыйПолучатель = Объект.Получатели.Добавить();
	//	НовыйПолучатель.Контрагент = Объект.Контрагент;
	//	НовыйПолучатель.Email = Объект.АдресПолучателя;
	//КонецЕсли;
	
	//Если ТипЗнч(Объект.Контрагент) = Тип("СправочникСсылка.Контрагенты") Тогда
	//	Элементы.КонтрагентДополнительно.Видимость = Объект.Контрагент.ПоказыватьДопИнформацию;
	//	КонтрагентДополнительно = Объект.Контрагент.Дополнительно;
	//Иначе
	//	Элементы.КонтрагентДополнительно.Видимость = Ложь;
	//КонецЕсли;	
	
КонецПроцедуры

&НаКлиенте
Процедура АдресПолучателяПриИзменении(Элемент)
	//НесколькоПолучателей();
КонецПроцедуры

&НаКлиенте
Процедура ОснованиеПриИзменении(Элемент)
	Элементы.ФормаВложитьФайлИзОснования.Видимость = ЗначениеЗаполнено(Объект.Основание);
КонецПроцедуры

#КонецОбласти

#Область ОбработчикиКомандФормы

&НаКлиенте
Процедура Отправить(Команда)
	
	Отказ = Ложь;
	Если Объект.Отправитель.Пустая() Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан отправитель";
		Сообщение.Поле = "Объект.Отправитель";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	//Если Объект.Получатели.Количество() > 1 Тогда 
	//Сделали >= 1 потому, что если клиент установит галочку Несколько получателей, тогда 
	//Проверка на валидность email будет проходить в поле Получатель, хотя будет показана таблица 
	//со списком получателей, даже если там он один
	Если Объект.Получатели.Количество() >= 1 Тогда
		Для Каждого Строка Из Объект.Получатели Цикл
			Если ПустаяСтрока(Строка.Email) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Не указан получатель";
				Сообщение.Поле = "Объект.Получатели";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;
			
			Если Не АдресВалидный(Строка.Email) И Не ПустаяСтрока(Строка.Email) Тогда
				Сообщение = Новый СообщениеПользователю();
				Сообщение.Текст = "Неверный email адрес получателя"; 
				Сообщение.Поле = "Объект.Получатели";
				Сообщение.УстановитьДанные(ЭтотОбъект);
				Сообщение.Сообщить();
				Отказ = Истина;
			КонецЕсли;				
		КонецЦикла;
	Иначе
		Если ПустаяСтрока(Объект.АдресПолучателя) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не указан получатель";
			Сообщение.Поле = "Объект.АдресПолучателя";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
		
		Если Не АдресВалидный(Объект.АдресПолучателя) И Не ПустаяСтрока(Объект.АдресПолучателя) Тогда
			Сообщение = Новый СообщениеПользователю();
			Сообщение.Текст = "Не верно указан email получателя";
			Сообщение.Поле = "Объект.АдресПолучателя";
			Сообщение.УстановитьДанные(ЭтотОбъект);
			Сообщение.Сообщить();
			Отказ = Истина;
		КонецЕсли;
	КонецЕсли;
	Если ПустаяСтрока(Объект.Заголовок) Тогда
		Сообщение = Новый СообщениеПользователю();
		Сообщение.Текст = "Не указан заголовок письма";
		Сообщение.Поле = "Объект.Заголовок";
		Сообщение.УстановитьДанные(ЭтотОбъект);
		Сообщение.Сообщить();
		Отказ = Истина;
	КонецЕсли;
	
	Если Отказ Тогда
		Возврат;
	КонецЕсли;
	
	ЭтаФорма.Записать();
	РезультатОтправки = ОтправитьНаСервере();
	Если НЕ ПустаяСтрока(РезультатОтправки) Тогда
		Сообщить(РезультатОтправки);
		Прочитать(); //++ №8201 чтобы данные перечитались, т.к. модификация объекта происходит вне формы
		ОбновитьФорму();
	Иначе
		ЭтаФорма.Закрыть();
	КонецЕсли;

КонецПроцедуры

&НаКлиенте
Процедура КомандаЗаписать(Команда)
	
	ЭтаФорма.Записать();
	ОбновитьФорму();
	
КонецПроцедуры

&НаКлиенте
Процедура ВложитьФайл(Команда)
	
	ЭтаФорма.Записать();
	
	ОписаниеОповещения = Новый ОписаниеОповещения("ВложитьФайлЗавершение", ЭтотОбъект);
	
	Режим = РежимДиалогаВыбораФайла.Открытие;
	ДиалогОткрытияФайла = Новый ДиалогВыбораФайла(Режим);
	ДиалогОткрытияФайла.ПолноеИмяФайла = "";
	ДиалогОткрытияФайла.МножественныйВыбор = Истина;
	ДиалогОткрытияФайла.Заголовок = "Выберите файлы";
	ДиалогОткрытияФайла.Показать(ОписаниеОповещения);
	
КонецПроцедуры

&НаКлиенте
Процедура ВложитьФайлЗавершение(ВыбранныеФайлы, ДополнительныеПараметры) Экспорт
	
	Если ВыбранныеФайлы = Неопределено Тогда
		ПоказатьОповещениеПользователя(НСтр("ru = 'Файл(ы) не выбран!'; en = 'File(s) not selected!'"));
		Возврат;
	КонецЕсли;
		
	МассивФайлов = ВыбранныеФайлы;
	Для Каждого ИмяФайла Из МассивФайлов Цикл
		ВыбФайл = Новый Файл(ИмяФайла);
		Если ВложитьФайлНаСервере(Объект.Ссылка,ВыбФайл.ИмяБезРасширения,ВыбФайл.Расширение, ОбщийМодуль.Сериализовать(Новый ДвоичныеДанные(ИмяФайла))) Тогда
			ПоказатьОповещениеПользователя("Файлы успешно прикреплены");
		Иначе
			Сообщить("Не удалось прикрепить файлы!",СтатусСообщения.Важное);
		КонецЕсли;
	КонецЦикла;	
	
	ОбновитьФорму();
	
КонецПроцедуры

//++ #12700
&НаКлиенте
Процедура ВложитьФайлИзОснования(Команда)
	
	ЭтаФорма.Записать();
	
	Если ЗначениеЗаполнено(Объект.Основание) Тогда
		ПараметрыФормы = Новый Структура("Основание", Объект.Основание);
		ОписаниеОповещения = Новый ОписаниеОповещения("ВложитьФайлИзОснованияЗавершение", ЭтотОбъект);
		ОткрытьФорму("Документ.ЭлектронноеПисьмо.Форма.ФормаВложенияИзОснования", ПараметрыФормы, ЭтотОбъект, , , , ОписаниеОповещения);
	Иначе
		ПоказатьПредупреждение(, "У письма нет основания");
	КонецЕсли;
	
КонецПроцедуры

&НаКлиенте
Процедура ВложитьФайлИзОснованияЗавершение(Результат, ДополнительныеПараметры) Экспорт
	
	Если Результат = Неопределено Тогда		
		Возврат;
	КонецЕсли;
	
	АдресФайла = ОбщийМодульВызовСервера.ПолучитьДанныеФайла(Результат.Документ, Результат.ИмяФайла, , ЭтотОбъект.УникальныйИдентификатор);	
	Если АдресФайла = Неопределено Тогда
		Сообщить("Ошибка получения содержимого файла!", СтатусСообщения.Важное);
		Возврат;	
	КонецЕсли;
	
	Если ВложитьФайлИзОснованияНаСервере(Результат, АдресФайла) Тогда
		ПоказатьОповещениеПользователя("Файлы успешно прикреплены");
	Иначе
		Сообщить("Не удалось прикрепить файлы!", СтатусСообщения.Важное);
	КонецЕсли;
	
	ОбновитьФорму();
	
КонецПроцедуры

&НаСервере
Функция ВложитьФайлИзОснованияНаСервере(Результат, АдресФайла)
	
	ДвоичныеДанные = ПолучитьИзВременногоХранилища(АдресФайла);
	Возврат ВложитьФайлНаСервере(Объект.Ссылка, Результат.ИмяФайла, "." + Результат.Расширение, ОбщийМодуль.Сериализовать(ДвоичныеДанные));
	
КонецФункции
//-- #12700

&НаКлиенте
Процедура ТекстовоеСодержимоеПисьма(Команда)
	
	Элементы.ФормаТекстовоеСодержимоеПисьма.Пометка = НЕ Элементы.ФормаТекстовоеСодержимоеПисьма.Пометка;
	
	Элементы.ГруппаТекстHTML.Видимость = НЕ Элементы.ФормаТекстовоеСодержимоеПисьма.Пометка;
	Элементы.ГруппаПростойТекст.Видимость = Элементы.ФормаТекстовоеСодержимоеПисьма.Пометка;
	
КонецПроцедуры

&НаКлиенте
Процедура ПолучитьТекстДляРазбора(Команда)
	
	ПараметрыФормы = Новый Структура;
	ПараметрыФормы.Вставить("ТекстПисьма", Объект.ТекстПисьма);
	ПараметрыФормы.Вставить("ТекстHTML", Объект.ТекстHTML);
	ОткрытьФорму("Документ.ЭлектронноеПисьмо.Форма.ФормаТекстДляРазбора", ПараметрыФормы, ЭтаФорма);
	
КонецПроцедуры

#КонецОбласти

#Область СтандартныеПодсистемы

// СтандартныеПодсистемы.ПодключаемыеКоманды
&НаКлиенте
Процедура Подключаемый_ВыполнитьКоманду(Команда)
	ОчиститьСообщения();
	ПодключаемыеКомандыКлиент.ВыполнитьКоманду(ЭтотОбъект, Команда, Объект);
КонецПроцедуры

&НаСервере
Процедура Подключаемый_ВыполнитьКомандуНаСервере(Контекст, Результат) Экспорт
	ПодключаемыеКоманды.ВыполнитьКоманду(ЭтотОбъект, Контекст, Объект, Результат);
КонецПроцедуры

&НаКлиенте
Процедура Подключаемый_ОбновитьКоманды()
	ПодключаемыеКомандыКлиентСервер.ОбновитьКоманды(ЭтотОбъект, Объект);
КонецПроцедуры
// Конец СтандартныеПодсистемы.ПодключаемыеКоманды

#КонецОбласти

#Область СлужебныеПроцедурыФункции

&НаСервере
Функция ПолучитьКоличествоВложений()
	
	Запрос = Новый Запрос;
	Запрос.Текст = Вложения.ТекстЗапроса;
	Запрос.УстановитьПараметр("СсылкаНаОбъект",Объект.Ссылка);
	Возврат Запрос.Выполнить().Выбрать().Количество();
	
КонецФункции

&НаКлиенте
Процедура ОбновитьФорму()
	
	//++ №8201
	НесколькоПолучателей = Объект.Получатели.Количество() > 0;
	ПризнакиПолучателей = ОпределитьПризнакиПолучателей();
	РазрешеноИзменениеГалочкиНесколькоПолучателей = ПризнакиПолучателей.РазрешеноИзменениеГалочкиНесколькоПолучателей И НЕ Объект.Отправлен;
	ПолностьюОтправлено = ПризнакиПолучателей.ПолностьюОтправлено ИЛИ Объект.Отправлен;
	//-- №8201
	
	Вложения.Параметры.УстановитьЗначениеПараметра("СсылкаНаОбъект",Объект.Ссылка);
	
	Элементы.ДатаОтправки.Видимость = Объект.Отправлен;
	//ЭтаФорма.ТолькоПросмотр = ПолностьюОтправлено; //Объект.Отправлен;
	ТолькоПросмотр = (НЕ Объект.Входящее И ПолностьюОтправлено);
	Элементы.ФормаЗаписать.Доступность = НЕ ПолностьюОтправлено; //Объект.Отправлен;
	Элементы.ФормаОтправить.Доступность = НЕ ПолностьюОтправлено; //Объект.Отправлен;
	Элементы.ФормаВложитьФайл.Доступность = НЕ ПолностьюОтправлено; //Объект.Отправлен;
	Элементы.Вложения.ТолькоПросмотр = ТолькоПросмотр; //ПолностьюОтправлено; //Объект.Отправлен;	
	Элементы.ГруппаВходящее.Видимость = Объект.Входящее;
	Элементы.Отправитель.Видимость = НЕ Объект.Входящее;
	Элементы.АдресОтправителя.Видимость = Объект.Входящее;
	Элементы.ГруппаСтатусПисьма.Видимость = НЕ Объект.Входящее;
	Элементы.ФормаОтправить.Видимость = НЕ Объект.Входящее;
	Элементы.ФормаГруппаПодменю.Видимость = Объект.Входящее;
	
	КоличествоВложений = ПолучитьКоличествоВложений();
	Если КоличествоВложений > 0 Тогда
		Элементы.ГруппаВложения.Заголовок = "Вложения ("+КоличествоВложений+")";
	Иначе
		Элементы.ГруппаВложения.Заголовок = "Вложения";
	КонецЕсли;
	
	//++ №8201
	Элементы.ПолучателиЗаполнитьПоГруппе.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
	Элементы.ПолучателиОчиститьТаблицуПолучателей.Доступность = НЕ ЭтаФорма.ТолькоПросмотр;
	Элементы.Контрагент.Видимость = НЕ Объект.Входящее И НЕ НесколькоПолучателей;
	Элементы.АдресПолучателя.Видимость = НЕ НесколькоПолучателей;
	Элементы.НесколькоПолучателей.Доступность = РазрешеноИзменениеГалочкиНесколькоПолучателей;
	Элементы.ГруппаНесколькоПолучателей.Видимость = НесколькоПолучателей И НЕ Объект.Входящее;
	Элементы.Отправлен.Видимость = НЕ НесколькоПолучателей;
	//-- №8201
	
	Если Объект.Входящее Тогда
		Элементы.ТекстПисьма.ТолькоПросмотр = Истина;
		Элементы.ФормаВложитьФайл.Доступность = Ложь;
		Элементы.ГруппаШапкаПисьма.ТолькоПросмотр = Истина;
		Элементы.Вложения.ТолькоПросмотр = Истина;
		Элементы.ГруппаДополнительно.ТолькоПросмотр = Истина;		
	КонецЕсли;
	
КонецПроцедуры

//++ №8201
&НаСервере
Процедура УстановитьУсловноеОформление()
	
	УсловноеОформление.Элементы.Очистить();

	// Запрещено редактировать строку, по которой письмо отправлено
	Элемент = УсловноеОформление.Элементы.Добавить();

	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПолучателиКонтрагент.Имя);
	
	ПолеЭлемента = Элемент.Поля.Элементы.Добавить();
	ПолеЭлемента.Поле = Новый ПолеКомпоновкиДанных(Элементы.ПолучателиEmail.Имя);
		
	ОтборЭлемента = Элемент.Отбор.Элементы.Добавить(Тип("ЭлементОтбораКомпоновкиДанных"));
	ОтборЭлемента.ЛевоеЗначение = Новый ПолеКомпоновкиДанных("Объект.Получатели.Отправлено");
	ОтборЭлемента.ВидСравнения = ВидСравненияКомпоновкиДанных.Равно;
	ОтборЭлемента.ПравоеЗначение = Истина;

	Элемент.Оформление.УстановитьЗначениеПараметра("ТолькоПросмотр", Истина);
	
КонецПроцедуры
//-- №8201

&НаСервере
Функция ВложитьФайлНаСервере(Ссылка, ИмяФайла, Расширение, Данные)
	Возврат РаботаСЭлектроннойПочтой.СохранитьВложение(Ссылка, ИмяФайла, Расширение, Данные);
КонецФункции

#КонецОбласти

&НаКлиенте
Процедура ВложенияПослеУдаления(Элемент)
	ОбновитьФорму();	
КонецПроцедуры

//++ №8201
&НаКлиенте
Функция ОпределитьПризнакиПолучателей()
	
	СтруктураВозврата = новый Структура;
	СтруктураВозврата.Вставить("РазрешеноИзменениеГалочкиНесколькоПолучателей", Истина);
	СтруктураВозврата.Вставить("ПолностьюОтправлено", Ложь);
	
	
	Для Каждого ТекущаяСтрока Из Объект.Получатели Цикл
		
		// Нужно такое условие присвоения
		Если ТекущаяСтрока.Отправлено Тогда
			СтруктураВозврата.ПолностьюОтправлено = Истина;
		Иначе	
			СтруктураВозврата.ПолностьюОтправлено = Ложь;
		КонецЕсли;
		
		//Первая строка может быть отправлена, поэтому проверяем со второй строки
		Если ТекущаяСтрока.НомерСтроки > 0 И ТекущаяСтрока.Отправлено Тогда
			СтруктураВозврата.РазрешеноИзменениеГалочкиНесколькоПолучателей = Ложь;
		КонецЕсли;
		
	КонецЦикла;
	
	Возврат СтруктураВозврата;
	
КонецФункции
//-- №8201

&НаСервере
Функция ОтправитьНаСервере()
	Возврат Документы.ЭлектронноеПисьмо.ОтправитьЭлектронноеПисьмо(Объект.Ссылка);
КонецФункции

&НаСервере
Функция ПолучитьДанные(СсылкаНаОбъект, ИмяФайла)
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	ПрикрепленныеДанныеЭлектронныхПисем.Данные
	|ИЗ
	|	РегистрСведений.ПрикрепленныеДанныеЭлектронныхПисем КАК ПрикрепленныеДанныеЭлектронныхПисем
	|ГДЕ
	|	ПрикрепленныеДанныеЭлектронныхПисем.СсылкаНаОбъект = &Ссылка
	|	И ПрикрепленныеДанныеЭлектронныхПисем.ИмяФайла = &ИмяФайла";
	Запрос.УстановитьПараметр("Ссылка",СсылкаНаОбъект);
	Запрос.УстановитьПараметр("ИмяФайла",ИмяФайла);
	
	
	Данные = Неопределено;
	Выборка = Запрос.Выполнить().Выгрузить();
	Если Выборка.Количество() > 0 тогда
		Данные = Выборка[0].Данные.Получить();
	КонецЕсли;
	 
	Возврат ПоместитьВоВременноеХранилище(Данные, ЭтаФорма.УникальныйИдентификатор);
	
КонецФункции

&НаКлиенте
Функция ПолучитьИмяВременногоФайлаСерв(Расширение)
	Возврат ПолучитьИмяВременногоФайла(Расширение);
КонецФункции

&НаКлиенте
Процедура ВложенияВыбор(Элемент, ВыбраннаяСтрока, Поле, СтандартнаяОбработка)
	
	СтандартнаяОбработка = Ложь;
	АдресФайла = ПолучитьДанные(Элементы.Вложения.ТекущиеДанные.СсылкаНаОбъект, Элементы.Вложения.ТекущиеДанные.ИмяФайла);
	ВременноеИмя = КаталогВременныхФайлов() + Элементы.Вложения.ТекущиеДанные.ИмяФайла + Элементы.Вложения.ТекущиеДанные.Расширение; ////ПолучитьИмяВременногоФайлаСерв(Элементы.Вложения.ТекущиеДанные.Расширение);
    ПолучитьФайл(АдресФайла, ВременноеИмя, Истина);
	
КонецПроцедуры

&НаКлиенте
Процедура НесколькоПолучателейПриИзменении(Элемент)
	НесколькоПолучателей();
КонецПроцедуры

&НаКлиенте
Процедура НесколькоПолучателей(ПриОткрытии = Ложь)
	
	Элементы.ГруппаНесколькоПолучателей.Видимость = НесколькоПолучателей;
	Элементы.Контрагент.Видимость = Не НесколькоПолучателей;
	Элементы.АдресПолучателя.Видимость = НЕ НесколькоПолучателей;
	
	Если Не ПриОткрытии Тогда
		Если НесколькоПолучателей Тогда
			Объект.Получатели.Очистить();
			//Если ЗначениеЗаполнено(Объект.Контрагент) Тогда
				НовыйПолучатель = Объект.Получатели.Добавить();
				НовыйПолучатель.Контрагент = Объект.Контрагент;
				НовыйПолучатель.Email = Объект.АдресПолучателя;
			//КонецЕсли;
		Иначе
			Если Не Объект.Получатели.Количество() = 0 Тогда
				Объект.Контрагент = Объект.Получатели[0].Контрагент;
				Объект.АдресПолучателя = Объект.Получатели[0].Email;
				Объект.Получатели.Очистить();
				//НовыйПолучатель = Объект.Получатели.Добавить();
				//НовыйПолучатель.Контрагент = Объект.Контрагент;
				//НовыйПолучатель.Email = Объект.АдресПолучателя;
			КонецЕсли;
		КонецЕсли;
	КонецЕсли;
	
КонецПроцедуры

&НаСервере
Функция ОсновнойEmailКонтрагента(Контрагент)
	Возврат ОбщийМодульСервер.ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(Контрагент);
КонецФункции

&НаКлиенте
Процедура ПолучателиКонтрагентПриИзменении(Элемент)
	Элементы.Получатели.ТекущиеДанные.Email = ОсновнойEmailКонтрагента(Элементы.Получатели.ТекущиеДанные.Контрагент);
КонецПроцедуры

&НаКлиенте
Процедура ЗаполнитьПоГруппе(Команда)
	ОП = Новый ОписаниеОповещения("ПослеВыбораГруппыКонтрагентов", ЭтотОбъект);
	ОткрытьФорму("Справочник.Контрагенты.ФормаВыбораГруппы",,ЭтотОбъект,,,,ОП,РежимОткрытияОкнаФормы.БлокироватьОкноВладельца);
КонецПроцедуры

&НаСервере
Процедура ПослеВыбораГруппыКонтрагентов(ЗначениеВыбора, ДопПараметры) Экспорт
	
	Запрос = Новый Запрос;
	Запрос.Текст =
	"ВЫБРАТЬ РАЗРЕШЕННЫЕ
	|	Контрагенты.Ссылка
	|ИЗ
	|	Справочник.Контрагенты КАК Контрагенты
	|ГДЕ
	|	Контрагенты.ЭтоГруппа = ЛОЖЬ
	|	И (Контрагенты.Родитель = &Родитель
	|			ИЛИ Контрагенты.Родитель.Родитель = &Родитель
	|			ИЛИ Контрагенты.Родитель.Родитель.Родитель = &Родитель
	|			ИЛИ Контрагенты.Родитель.Родитель.Родитель.Родитель = &Родитель
	|			ИЛИ Контрагенты.Родитель.Родитель.Родитель.Родитель.Родитель = &Родитель)";
	Запрос.УстановитьПараметр("Родитель",ЗначениеВыбора);
	РезультатЗапроса = Запрос.Выполнить();
	Если РезультатЗапроса.Пустой() Тогда 
		Сообщить("Группа """ + ЗначениеВыбора + """ пустая");
		Возврат;
	КонецЕсли;
	
	Выборка = РезультатЗапроса.Выбрать();
	Пока Выборка.Следующий() Цикл
		НоваяСтрока = Объект.Получатели.Добавить();
		НоваяСтрока.Контрагент = Выборка.Ссылка;
		НоваяСтрока.Email = ОбщийМодульСервер.ПолучитьЭлектроннуюПочтуИзКонтактнойИнформации(НоваяСтрока.Контрагент);
	КонецЦикла;
	
КонецПроцедуры

&НаКлиенте
Процедура ОчиститьТаблицуПолучателей(Команда)
	
	//++ №8201 очистку делаем не полностью, т.к. по каким-то строкам письма, могли быть отправлены
	//Объект.Получатели.Очистить();
	
	КоличествоСтрок = Объект.Получатели.Количество()-1;
	Для Сч = 0 По КоличествоСтрок Цикл
		
		Если НЕ Объект.Получатели[КоличествоСтрок-Сч].Отправлено Тогда
			Объект.Получатели.Удалить(КоличествоСтрок-Сч);
		КонецЕсли;
		
	КонецЦикла;
	
	//-- №8201
	
КонецПроцедуры

&НаКлиенте
Функция АдресВалидный(Email)
	
	ПозицияСобаки = Найти(Email, "@");
	
	Если Не ПозицияСобаки = 0 И Не ПозицияСобаки = 1 Тогда		
		Если Найти(Сред(Email, ПозицияСобаки + 1), ".") = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
	Иначе
		Возврат Ложь;
	КонецЕсли;
	
	
	// Проверим адрес на допустимые символы
	ДопустимыеСимволы = "abcdefghijklmnopqrstuvwxyzABCDEFGHIJKLMNOPQRSTUVWXYZ0123456789._-@";
	
	Позиция = 1;
	
	Пока Позиция <= СтрДлина(Email) Цикл
		
		ТекущийСимвол = ВРег(Сред(Email, Позиция, 1));
		
		Если Найти(ДопустимыеСимволы, ТекущийСимвол) = 0 Тогда
			Возврат Ложь;
		КонецЕсли;
		
		Позиция = Позиция + 1;
		
	КонецЦикла;
	
	Возврат Истина;

КонецФункции

&НаКлиенте
Процедура ВходящееПриИзменении(Элемент)
	ОбновитьФорму();
КонецПроцедуры

&НаКлиенте
Процедура ПолучателиПередУдалением(Элемент, Отказ)
	
	//++ №8201 удаление делаем только если не отправлено
	ТекущиеДанные = Элементы.Получатели.ТекущиеДанные;
	
	Если ТекущиеДанные = Неопределено Тогда
		Возврат;
	КонецЕсли;
	
	Если ТекущиеДанные.Отправлено Тогда
		Отказ = Истина;
	КонецЕсли;
	//-- №8201
	
КонецПроцедуры

&НаКлиенте
Процедура ТекстHTMLПриНажатии(Элемент, ДанныеСобытия, СтандартнаяОбработка)
	СтандартнаяОбработка = Ложь;	
КонецПроцедуры
